app/Filament/CustomWidgets/OtherExpensesStats.php

    protected function getStats(): array
    {
        // Fechas clave
        $today = Carbon::today();
        $yesterday = Carbon::yesterday();
        $startOfWeek = Carbon::now()->startOfWeek();
        $startOfLastWeek = $startOfWeek->copy()->subWeek();

        $startOfMonth = Carbon::now()->startOfMonth();
        $startOfLastMonth = $startOfMonth->copy()->subMonth();
        $endOfLastMonth = $startOfMonth->copy()->subDay();

        // Función para obtener suma total de gastos entre fechas
        $getExpenses = fn($start, $end = null) => OtherExpense::query()->myCenter()
            ->when($end, fn($q) => $q->whereBetween('date', [$start, $end]))
            ->when(!$end, fn($q) => $q->whereDate('date', $start))
            ->get()
            ->sum(fn($expense) => $expense->total);
---
select * from `other_expenses` where `date` between '2025-08-25 00:00:00' and '2025-08-30 09:21:02'

    private function getDailyExpenses(Carbon $startDate): array
    {
        $endDate = Carbon::today();

        $expensesByDay = [];

        if ($startDate->gt($endDate)) {
            return $expensesByDay;
        }

        $currentDate = $startDate->copy();

        while ($currentDate->lte($endDate)) {
            $dateString = $currentDate->format('Y-m-d');

            $total = OtherExpense::whereDate('date', $dateString)->myCenter()
                ->get()
                ->sum(fn($expense) => $expense->total);
---
select * from `other_expenses` where date(`date`) = '2025-08-29'