app/Filament/CustomWidgets/OtherExpensesChart.php

select * from `other_expenses` where year(`date`) >= 2023
---
    private function getMonthlyExpensesByYear(): array
    {
        $expenses = OtherExpense::query()->myCenter()
            ->whereYear('date', '>=', now()->year - 2)  // últimos 3 años (puedes ajustar)
            ->get()
            ->groupBy(fn($expense) => Carbon::parse($expense->date)->year)
            ->map(function ($expensesByYear) {
                return $expensesByYear->groupBy(fn($expense) => Carbon::parse($expense->date)->format('m'))
                    ->map(fn($expensesByMonth) => $expensesByMonth->sum('total'));
            });