app/Livewire/FrontBooking.php

    public function getShowItemsProperty()
    {
        return Cache::remember('show_items', now()->addMinutes(10), function () {
            return Item::showBooking()->orderBy('price', 'asc')->get();
        });
---
select * from `items` where `show_booking` = 1 order by `price` asc

    public function getShowItemsOthersProperty()
    {
        return Cache::remember('show_items_others', now()->addMinutes(10), function () {
            return Item::showBookingOthers()->orderBy('price', 'asc')->get();
        });
---
select * from `items` where `show_booking_others` = 1 order by `price` asc

    public function mount()
    {
        $this->apppointment = new Appointment();
        $this->selectedDate = Carbon::now()->format("Y-m-d");

        $this->workerlist = User::canAppointment()->get();
        $this->showItems = Item::showBooking()->orderBy('price', 'asc')->get();
        $this->showItemsOthers = Item::showBookingOthers()->orderBy('price', 'asc')->get();
        /* $this->countries = Country::activos()
            ->select('id', 'name', 'phonecode')
            ->orderBy('name', 'asc')
            ->get();*/
        $this->highlightedDates = Appointment::active()
            ->where("date", ">=", Carbon::now()->format('Y-m-d'))
            ->statusAvailable()
            ->distinct("date") // 👈 solo fechas únicas
            ->pluck("date")
            ->map(fn($date) => Carbon::parse($date)->format("Y-m-d"))
            ->toArray();
---
select * from `users` where `can_appointment` = 1
select * from `items` where `show_booking` = 1 order by `price` asc
select * from `items` where `show_booking_others` = 1 order by `price` asc
select distinct `date` from `appointments` where `active` = 1 and `date` >= '2025-08-30' and `status` = 'available'

    public function loadAppointments()
    {
        $this->apppointmentList = Appointment::with('worker') // carga los trabajadores relacionados
            ->active()
            ->where('date', $this->selectedDate)
            ->when(!empty($this->worker_id), fn($query) => $query->where('worker_id', $this->worker_id))
            ->statusAvailable()
            ->orderBy('start_time', 'asc')
            ->get();

        if (!empty($this->selectedAppointment)) {
---
select * from `appointments` where `active` = 1 and `date` = '2025-08-30' and `status` = 'available' order by `start_time` asc

    public function getSelectedItem()
    {
        $this->selectedItem = Item::find($this->form["item_id"]);
---
select * from `items` where `items`.`id` = '32' limit 1

    public function getSelectedOtherItem()
    {
        $this->selecteOtherdItem = Item::find($this->other_item_id);
---
select * from `items` where `items`.`id` = '31' limit 1