app/Livewire/FrontBooking.php

    public function mount()
    {
        $this->apppointment = new Appointment();
        $this->selectedDate = Carbon::now()->format("Y-m-d");

        $this->workerlist = User::canAppointment()->get();
---
select * from `users` where `can_appointment` = 1

    public function render()
    {
        // Cargar citas inicialmente
        $this->loadAppointments();
        $this->selectedItem = Item::find($this->form["item_id"]);
        $this->selecteOtherdItem = Item::find($this->other_item_id);
---
select * from `items` where `items`.`id` = '32' limit 1