app/Http/Controllers/FrontBookingController.php

select * from `settings` limit 1
select * from `states` where `states`.`id` = '1203' and `states`.`deleted_at` is null limit 1
select * from `cities` where `cities`.`id` = '34846' and `cities`.`deleted_at` is null limit 1
---
    public function index()
    {
        $jumbotron = CmsContent::findBySlug('header-jumbotron');
        $aboutUs = CmsContent::findBySlug('about-us');
        $discounts = CmsContent::findBySlug('discounts');
        $service = CmsContent::findBySlug('services');
        $priceList = CmsContent::findBySlug('price-catalog');
        $contactForm = CmsContent::findBySlug('contact-form');
        $gallery = CmsContent::findBySlug('gallery');

        $settings = Setting::first();
        $generalSettings = $settings?->general;
        // $generalSettings?->brand_name = $generalSettings?->brand_name ?? config('app.name', 'Mi Empresa');
        $state = State::find(trim($generalSettings->state_id, '"'));
        $city = City::find(trim($generalSettings->city_id, '"'));