app/Models/CmsContent.php

    public static function findBySlug(string $slug): ?self
    {
        return self::where('slug', $slug)->first();
---
select * from `cms_contents` where `slug` = 'header-jumbotron' limit 1