app/Models/Order.php

select * from `order_details` where `order_details`.`order_id` = 118 and `order_details`.`order_id` is not null
---
    public function getImpuestosAttribute(): float
    {
        return round($this->orderDetails->sum('taxes_amount'), 2);